_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_41 (Conv2D)           (None, 32, 7, 7)          544       
_________________________________________________________________
conv2d_42 (Conv2D)           (None, 31, 6, 64)         1856      
_________________________________________________________________
conv2d_43 (Conv2D)           (None, 30, 5, 128)        32896     
_________________________________________________________________
conv2d_44 (Conv2D)           (None, 29, 4, 160)        82080     
_________________________________________________________________
conv2d_45 (Conv2D)           (None, 28, 3, 256)        164096    
_________________________________________________________________
flatten_9 (Flatten)          (None, 21504)             0         
_________________________________________________________________
dense_9 (Dense)              (None, 5)                 107525    
=================================================================
Total params: 388,997
Trainable params: 388,997
Non-trainable params: 0
_________________________________________________________________
