_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_51 (Conv2D)           (None, 8, 7, 7)           136       
_________________________________________________________________
conv2d_52 (Conv2D)           (None, 7, 6, 16)          464       
_________________________________________________________________
conv2d_53 (Conv2D)           (None, 6, 5, 16)          1040      
_________________________________________________________________
conv2d_54 (Conv2D)           (None, 5, 4, 32)          2080      
_________________________________________________________________
conv2d_55 (Conv2D)           (None, 4, 3, 32)          4128      
_________________________________________________________________
flatten_11 (Flatten)         (None, 384)               0         
_________________________________________________________________
dense_11 (Dense)             (None, 5)                 1925      
=================================================================
Total params: 9,773
Trainable params: 9,773
Non-trainable params: 0
_________________________________________________________________
