_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_26 (Conv2D)           (None, 32, 7, 7)          544       
_________________________________________________________________
conv2d_27 (Conv2D)           (None, 31, 6, 64)         1856      
_________________________________________________________________
conv2d_28 (Conv2D)           (None, 30, 5, 128)        32896     
_________________________________________________________________
conv2d_29 (Conv2D)           (None, 29, 4, 256)        131328    
_________________________________________________________________
conv2d_30 (Conv2D)           (None, 28, 3, 256)        262400    
_________________________________________________________________
flatten_6 (Flatten)          (None, 21504)             0         
_________________________________________________________________
dense_6 (Dense)              (None, 5)                 107525    
=================================================================
Total params: 536,549
Trainable params: 536,549
Non-trainable params: 0
_________________________________________________________________
