_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_19 (Conv2D)           (None, 8, 6, 6)           296       
_________________________________________________________________
conv2d_20 (Conv2D)           (None, 6, 4, 32)          1760      
_________________________________________________________________
conv2d_21 (Conv2D)           (None, 4, 2, 128)         36992     
_________________________________________________________________
flatten_6 (Flatten)          (None, 1024)              0         
_________________________________________________________________
dense_6 (Dense)              (None, 5)                 5125      
=================================================================
Total params: 44,173
Trainable params: 44,173
Non-trainable params: 0
_________________________________________________________________
