_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 8, 7, 7)           128       
_________________________________________________________________
batch_normalization_1 (Batch (None, 8, 7, 7)           28        
_________________________________________________________________
activation_1 (Activation)    (None, 8, 7, 7)           0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 7, 6, 16)          448       
_________________________________________________________________
batch_normalization_2 (Batch (None, 7, 6, 16)          64        
_________________________________________________________________
activation_2 (Activation)    (None, 7, 6, 16)          0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 6, 5, 32)          2048      
_________________________________________________________________
batch_normalization_3 (Batch (None, 6, 5, 32)          128       
_________________________________________________________________
activation_3 (Activation)    (None, 6, 5, 32)          0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 5, 4, 64)          8192      
_________________________________________________________________
batch_normalization_4 (Batch (None, 5, 4, 64)          256       
_________________________________________________________________
activation_4 (Activation)    (None, 5, 4, 64)          0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 4, 3, 128)         32768     
_________________________________________________________________
batch_normalization_5 (Batch (None, 4, 3, 128)         512       
_________________________________________________________________
activation_5 (Activation)    (None, 4, 3, 128)         0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 1536)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 5)                 7685      
=================================================================
Total params: 52,257
Trainable params: 51,763
Non-trainable params: 494
_________________________________________________________________
