_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_6 (Conv2D)            (None, 32, 7, 7)          544       
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 31, 6, 64)         1856      
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 30, 5, 128)        32896     
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 29, 4, 160)        82080     
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 28, 3, 256)        164096    
_________________________________________________________________
flatten_2 (Flatten)          (None, 21504)             0         
_________________________________________________________________
dense_2 (Dense)              (None, 5)                 107525    
=================================================================
Total params: 388,997
Trainable params: 388,997
Non-trainable params: 0
_________________________________________________________________
