_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 8, 7, 7)           136       
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 7, 6, 16)          464       
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 6, 5, 32)          2080      
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 5, 4, 64)          8256      
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 4, 3, 128)         32896     
_________________________________________________________________
flatten_1 (Flatten)          (None, 1536)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 5)                 7685      
=================================================================
Total params: 51,517
Trainable params: 51,517
Non-trainable params: 0
_________________________________________________________________
