_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_36 (Conv2D)           (None, 32, 7, 7)          544       
_________________________________________________________________
conv2d_37 (Conv2D)           (None, 31, 6, 64)         1856      
_________________________________________________________________
conv2d_38 (Conv2D)           (None, 30, 5, 128)        32896     
_________________________________________________________________
conv2d_39 (Conv2D)           (None, 29, 4, 160)        82080     
_________________________________________________________________
conv2d_40 (Conv2D)           (None, 28, 3, 256)        164096    
_________________________________________________________________
flatten_8 (Flatten)          (None, 21504)             0         
_________________________________________________________________
dense_8 (Dense)              (None, 5)                 107525    
=================================================================
Total params: 388,997
Trainable params: 388,997
Non-trainable params: 0
_________________________________________________________________
