_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_26 (Conv2D)           (None, 8, 7, 7)           136       
_________________________________________________________________
conv2d_27 (Conv2D)           (None, 7, 6, 16)          464       
_________________________________________________________________
conv2d_28 (Conv2D)           (None, 6, 5, 32)          2080      
_________________________________________________________________
conv2d_29 (Conv2D)           (None, 5, 4, 64)          8256      
_________________________________________________________________
conv2d_30 (Conv2D)           (None, 4, 3, 256)         65792     
_________________________________________________________________
flatten_6 (Flatten)          (None, 3072)              0         
_________________________________________________________________
dense_6 (Dense)              (None, 5)                 15365     
=================================================================
Total params: 92,093
Trainable params: 92,093
Non-trainable params: 0
_________________________________________________________________
