_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 8, 7, 7)           136       
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 7, 6, 32)          928       
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 6, 5, 64)          8256      
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 5, 4, 128)         32896     
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 4, 3, 256)         131328    
_________________________________________________________________
flatten_1 (Flatten)          (None, 3072)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 5)                 15365     
=================================================================
Total params: 188,909
Trainable params: 188,909
Non-trainable params: 0
_________________________________________________________________
