_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_18 (Conv2D)           (None, 16, 6, 6)          592       
_________________________________________________________________
conv2d_19 (Conv2D)           (None, 14, 4, 64)         3520      
_________________________________________________________________
conv2d_20 (Conv2D)           (None, 12, 2, 64)         36928     
_________________________________________________________________
flatten_6 (Flatten)          (None, 1536)              0         
_________________________________________________________________
dense_6 (Dense)              (None, 5)                 7685      
=================================================================
Total params: 48,725
Trainable params: 48,725
Non-trainable params: 0
_________________________________________________________________
